/**
 * Created by Andste on 2017/8/7.
 */
export default {
    //  手机号
    mobile   : /^1\d{10}$/,
    //  电子邮箱
    email    : /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
    //  密码【6-20位】
    password : /^[\@A-Za-z0-9\!\#\$\%\^\&\*\.\~\,]{6,20}$/,
    //  正整数【不包含0】
    integer  : /^[1-9]\d*$/,
    //  price
    price    : /(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/,
    //  纳税识别号
    TINumber: /^((\d{6}[0-9A-Z]{9})|([0-9A-Za-z]{2}\d{6}[0-9A-Za-z]{10,12}))$/,
    // 姓名
    name: /^[\u4e00-\u9fa5]+(·[\u4e00-\u9fa5]+)*$/,
    // 中英文、数字组成
    modifiedName:/^[\u4e00-\u9fa5_a-zA-Z0-9]+$/
};